====================
Simple use directive
====================

use foo;

---

(source_file
  (use_directive
    (identifier
      (name))))

============================
Use directive with namespace
============================

use foo::bar;

---

(source_file
  (use_directive
    (identifier
      (name)
      (name))))

========================
Use directive with alias
========================

use foo = bar;

---

(source_file
  (use_directive
    (use_alias
      (name)
      (identifier
        (name)))))

======================================
Use directive with alias and namespace
======================================

use foo = bar::baz;

---

(source_file
  (use_directive
    (use_alias
      (name)
      (identifier
        (name)
        (name)))))
