====================
Simple use directive
====================

use foo;
use foo::bar;

---

(source_file
  (use_directive
    (identifier))
  (use_directive
    (identifier)))

========================
Use directive with alias
========================

use foo = bar;
use foo = bar::baz;

---

(source_file
  (use_directive
    (use_alias
      (identifier)
      (identifier)))
  (use_directive
    (use_alias
      (identifier)
      (identifier))))

=======================
Use directive with list
=======================

use foo::{a};
use foo::{a,};
use foo::{a,b};
use foo::{a,b,};
use foo::bar::{a};
use foo::bar::{a,};
use foo::bar::{a,b};
use foo::bar::{a,b,};

---

(source_file
  (use_directive
    (use_list
      (identifier)
      (name)))
  (use_directive
    (use_list
      (identifier)
      (name)))
  (use_directive
    (use_list
      (identifier)
      (name)
      (name)))
  (use_directive
    (use_list
      (identifier)
      (name)
      (name)))
  (use_directive
    (use_list
      (identifier)
      (name)))
  (use_directive
    (use_list
      (identifier)
      (name)))
  (use_directive
    (use_list
      (identifier)
      (name)
      (name)))
  (use_directive
    (use_list
      (identifier)
      (name)
      (name))))

===========================
Use directive with wildcard
===========================

use foo::*;
use foo::bar::*;

---

(source_file
  (use_directive
    (use_wildcard
      (identifier)))
  (use_directive
    (use_wildcard
      (identifier))))
